backend/app/models/user.rb

    def create_passport
        Passport.create(user: self)
---
INSERT INTO "passports" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2021-04-14 21:23:09.410314"], ["updated_at", "2021-04-14 21:23:09.410314"]]

    def trips
        self.passport.trips.map{|trip| {id: trip.id, city: trip.city.name, flag: trip.city.flag_url, continent: trip.city.continent, country: trip.city.country, state: trip.city.state, date: trip.date_travelled}}
---
SELECT "passports".* FROM "passports" WHERE "passports"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."passport_id" = ?  [["passport_id", 1]]

    def next_city
        been_there = self.passport.trips.map{|trip| trip.city}              # cities you've already traveled to
        less_wandered = City.all.filter{|city| !been_there.include?(city)}  # cities you haven't traveled to yet
        less_wandered.empty? ? City.all.sample : less_wandered.sample
---
SELECT "passports".* FROM "passports" WHERE "passports"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."passport_id" = ?  [["passport_id", 1]]
SELECT "cities".* FROM "cities"