backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def authenticate
        auth_header = request.headers["Authorization"]
        token = auth_header.split.last
        payload = JWT.decode(token, ENV["JWT_SECRET"], true, { algorithm: 'HS256' }).first
        @user = User.find_by(id: payload["user_id"])