backend/app/controllers/cities_controller.rb

    def info
        # lat = params[:lat]
        # long = params[:long]
        # response = Unirest.get("https://maps.googleapis.com/maps/api/geocode/json?latlng=#{lat},#{long}&key=#{ENV["GOOGLE_MAPS_API_KEY"]}")
        # puts "*****"
        # puts response.body["results"][0]["address_components"]
        # puts "*****"
        # render json: response.body["results"][0]["address_components"]
        @user = User.find(params[:id])
        @city = @user.next_city
        @user.passport.trips.create(city: @city, date_travelled: Time.now.strftime("%A %B %d, %Y") )
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cities" ("name", "flag_url", "continent", "country", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "trips" ("date_travelled", "passport_id", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date_travelled", "Wednesday April 14, 2021"], ["passport_id", 1], ["city_id", 8], ["created_at", "2021-04-14 21:23:55.631930"], ["updated_at", "2021-04-14 21:23:55.631930"]]