backend/app/controllers/trips_controller.rb

DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def delete
        Trip.find(params[:id]).destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cities".* FROM "cities" WHERE "cities"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]
INSERT INTO "cities" ("name", "flag_url", "continent", "country", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "trips" ("date_travelled", "passport_id", "city_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date_travelled", "Mon, Apr 12, 2021"], ["passport_id", 1], ["city_id", 3], ["created_at", "2021-04-12 18:37:36.287697"], ["updated_at", "2021-04-12 18:37:36.287697"]]
---
    def create
        @user = User.find(params[:id])
        @city = City.find_by(name: params[:city])
        @user.passport.trips.create(city: @city, date_travelled: Time.now.strftime("%a, %b %d, %Y") )