backend/app/controllers/users_controller.rb

    def login
        @user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "BingoBongo"], ["LIMIT", 1]]

    def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "zak"], ["password_digest", "$2a$12$1R1rb0SaKiwfcW1XNDcoKuwIIJgUdXEgekPuehW9OQ0Vic.2rHj/W"], ["created_at", "2021-04-15 15:54:33.338261"], ["updated_at", "2021-04-15 15:54:33.338261"]]

    def update_username
        @user = User.find(params[:id])
        @user.update(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Bizarro"], ["updated_at", "2021-04-12 17:39:06.481915"], ["id", 1]]

    def update_password
        @user = User.find(params[:id])
        if @user.authenticate(params[:oldPassword])
            @user.update(password: params[:newPassword])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$YLMIbXgzHIefEcPeeng69O2QkGQPUTH3Izbw9lzgHNzbv2/N1k4xq"], ["updated_at", "2021-04-12 17:52:24.597615"], ["id", 1]]

    def trips
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]